InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/FLASH/Peripheral/Register/xHeader/FLASH_RegisterDefines.h
/**
 *
 * @file FLASH_RegisterDefines.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 21 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 21 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_FLASH_FLASH_PERIPHERAL_FLASH_REGISTER_FLASH_REGISTERDEFINES_H_
#define XDRIVER_MCU_DRIVER_HEADER_FLASH_FLASH_PERIPHERAL_FLASH_REGISTER_FLASH_REGISTERDEFINES_H_

#include <xUtils/Standard/Standard.h>

/******************************************************************************************
************************************ 1 FMA *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_FMA_R_OFFSET_MASK     ((uint32_t)0x0003FFFFU)
#define FLASH_FMA_R_OFFSET_BIT      (0U)

#define FLASH_FMA_OFFSET_MASK       ((uint32_t)0x0003FFFFU)
/*----------*/

/******************************************************************************************
************************************ 2 FMD *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_FMD_R_DATA_MASK     ((uint32_t)0xFFFFFFFFU)
#define FLASH_FMD_R_DATA_BIT      (0U)

#define FLASH_FMD_DATA_MASK       ((uint32_t)0xFFFFFFFFU)
/*----------*/

/******************************************************************************************
************************************ 3 FMC *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_FMC_R_WRITE_MASK          ((uint32_t)0x00000001U)
#define FLASH_FMC_R_WRITE_BIT           (0U)
#define FLASH_FMC_R_WRITE_COMPLETE      ((uint32_t)0x00000000U)
#define FLASH_FMC_R_WRITE_NOCOMPLETE    ((uint32_t)0x00000001U)
#define FLASH_FMC_R_WRITE_WRITE         ((uint32_t)0x00000001U)

#define FLASH_FMC_WRITE_MASK            ((uint32_t)0x00000001U)
#define FLASH_FMC_WRITE_COMPLETE        ((uint32_t)0x00000000U)
#define FLASH_FMC_WRITE_NOCOMPLETE      ((uint32_t)0x00000001U)
#define FLASH_FMC_WRITE_WRITE           ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FMC_R_ERASE_MASK          ((uint32_t)0x00000002U)
#define FLASH_FMC_R_ERASE_BIT           (1U)
#define FLASH_FMC_R_ERASE_COMPLETE      ((uint32_t)0x00000000U)
#define FLASH_FMC_R_ERASE_NOCOMPLETE    ((uint32_t)0x00000002U)
#define FLASH_FMC_R_ERASE_ERASE         ((uint32_t)0x00000002U)

#define FLASH_FMC_ERASE_MASK            ((uint32_t)0x00000001U)
#define FLASH_FMC_ERASE_COMPLETE        ((uint32_t)0x00000000U)
#define FLASH_FMC_ERASE_NOCOMPLETE      ((uint32_t)0x00000001U)
#define FLASH_FMC_ERASE_ERASE           ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FMC_R_MERASE_MASK          ((uint32_t)0x00000004U)
#define FLASH_FMC_R_MERASE_BIT           (2U)
#define FLASH_FMC_R_MERASE_COMPLETE      ((uint32_t)0x00000000U)
#define FLASH_FMC_R_MERASE_NOCOMPLETE    ((uint32_t)0x00000004U)
#define FLASH_FMC_R_MERASE_MERASE        ((uint32_t)0x00000004U)

#define FLASH_FMC_MERASE_MASK           ((uint32_t)0x00000001U)
#define FLASH_FMC_MERASE_COMPLETE       ((uint32_t)0x00000000U)
#define FLASH_FMC_MERASE_NOCOMPLETE     ((uint32_t)0x00000001U)
#define FLASH_FMC_MERASE_MERASE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FMC_R_COMT_MASK           ((uint32_t)0x00000008U)
#define FLASH_FMC_R_COMT_BIT            (3U)
#define FLASH_FMC_R_COMT_COMPLETE       ((uint32_t)0x00000000U)
#define FLASH_FMC_R_COMT_NOCOMPLETE     ((uint32_t)0x00000008U)
#define FLASH_FMC_R_COMT_WRITE          ((uint32_t)0x00000008U)

#define FLASH_FMC_COMT_MASK             ((uint32_t)0x00000001U)
#define FLASH_FMC_COMT_COMPLETE         ((uint32_t)0x00000000U)
#define FLASH_FMC_COMT_NOCOMPLETE       ((uint32_t)0x00000001U)
#define FLASH_FMC_COMT_WRITE            ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FMC_R_WRKEY_MASK          ((uint32_t)0xFFFF0000U)
#define FLASH_FMC_R_WRKEY_BIT           (16U)
#define FLASH_FMC_R_WRKEY_KEY1          ((uint32_t)0xA4420000U)
#define FLASH_FMC_R_WRKEY_KEY2          ((uint32_t)0x71D50000U)

#define FLASH_FMC_WRKEY_MASK            ((uint32_t)0x0000FFFFU)
#define FLASH_FMC_WRKEY_KEY1            ((uint32_t)0x0000A442U)
#define FLASH_FMC_WRKEY_KEY2            ((uint32_t)0x000071D5U)
/*----------*/

/******************************************************************************************
************************************ 4 FCRIS *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_FCRIS_R_ARIS_MASK         ((uint32_t)0x00000001U)
#define FLASH_FCRIS_R_ARIS_BIT          (0U)
#define FLASH_FCRIS_R_ARIS_NOACTIVE     ((uint32_t)0x00000000U)
#define FLASH_FCRIS_R_ARIS_ACTIVE       ((uint32_t)0x00000001U)

#define FLASH_FCRIS_ARIS_MASK           ((uint32_t)0x00000001U)
#define FLASH_FCRIS_ARIS_NOACTIVE       ((uint32_t)0x00000000U)
#define FLASH_FCRIS_ARIS_ACTIVE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCRIS_R_PRIS_MASK         ((uint32_t)0x00000002U)
#define FLASH_FCRIS_R_PRIS_BIT          (1U)
#define FLASH_FCRIS_R_PRIS_NOACTIVE     ((uint32_t)0x00000000U)
#define FLASH_FCRIS_R_PRIS_ACTIVE       ((uint32_t)0x00000002U)

#define FLASH_FCRIS_PRIS_MASK           ((uint32_t)0x00000001U)
#define FLASH_FCRIS_PRIS_NOACTIVE       ((uint32_t)0x00000000U)
#define FLASH_FCRIS_PRIS_ACTIVE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCRIS_R_ERIS_MASK         ((uint32_t)0x00000004U)
#define FLASH_FCRIS_R_ERIS_BIT          (2U)
#define FLASH_FCRIS_R_ERIS_NOACTIVE     ((uint32_t)0x00000000U)
#define FLASH_FCRIS_R_ERIS_ACTIVE       ((uint32_t)0x00000004U)

#define FLASH_FCRIS_ERIS_MASK           ((uint32_t)0x00000001U)
#define FLASH_FCRIS_ERIS_NOACTIVE       ((uint32_t)0x00000000U)
#define FLASH_FCRIS_ERIS_ACTIVE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCRIS_R_VOLTRIS_MASK      ((uint32_t)0x00000200U)
#define FLASH_FCRIS_R_VOLTRIS_BIT       (9U)
#define FLASH_FCRIS_R_VOLTRIS_NOACTIVE  ((uint32_t)0x00000000U)
#define FLASH_FCRIS_R_VOLTRIS_ACTIVE    ((uint32_t)0x00000200U)

#define FLASH_FCRIS_VOLTRIS_MASK        ((uint32_t)0x00000001U)
#define FLASH_FCRIS_VOLTRIS_NOACTIVE    ((uint32_t)0x00000000U)
#define FLASH_FCRIS_VOLTRIS_ACTIVE      ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCRIS_R_INVDRIS_MASK      ((uint32_t)0x00000400U)
#define FLASH_FCRIS_R_INVDRIS_BIT       (10U)
#define FLASH_FCRIS_R_INVDRIS_NOACTIVE  ((uint32_t)0x00000000U)
#define FLASH_FCRIS_R_INVDRIS_ACTIVE    ((uint32_t)0x00000400U)

#define FLASH_FCRIS_INVDRIS_MASK        ((uint32_t)0x00000001U)
#define FLASH_FCRIS_INVDRIS_NOACTIVE    ((uint32_t)0x00000000U)
#define FLASH_FCRIS_INVDRIS_ACTIVE      ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCRIS_R_ERRIS_MASK        ((uint32_t)0x00000800U)
#define FLASH_FCRIS_R_ERRIS_BIT         (11U)
#define FLASH_FCRIS_R_ERRIS_NOACTIVE    ((uint32_t)0x00000000U)
#define FLASH_FCRIS_R_ERRIS_ACTIVE      ((uint32_t)0x00000800U)

