InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/FLASH/Peripheral/Register/xHeader/FLASH_RegisterDefines.h
#define FLASH_FCRIS_ERRIS_MASK          ((uint32_t)0x00000001U)
#define FLASH_FCRIS_ERRIS_NOACTIVE      ((uint32_t)0x00000000U)
#define FLASH_FCRIS_ERRIS_ACTIVE        ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCRIS_R_PROGRIS_MASK      ((uint32_t)0x00002000U)
#define FLASH_FCRIS_R_PROGRIS_BIT       (13U)
#define FLASH_FCRIS_R_PROGRIS_NOACTIVE  ((uint32_t)0x00000000U)
#define FLASH_FCRIS_R_PROGRIS_ACTIVE    ((uint32_t)0x00002000U)

#define FLASH_FCRIS_PROGRIS_MASK        ((uint32_t)0x00000001U)
#define FLASH_FCRIS_PROGRIS_NOACTIVE    ((uint32_t)0x00000000U)
#define FLASH_FCRIS_PROGRIS_ACTIVE      ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************ 5 FCIM *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_FCIM_R_AMASK_MASK         ((uint32_t)0x00000001U)
#define FLASH_FCIM_R_AMASK_BIT          (0U)
#define FLASH_FCIM_R_AMASK_DIS          ((uint32_t)0x00000000U)
#define FLASH_FCIM_R_AMASK_EN           ((uint32_t)0x00000001U)

#define FLASH_FCIM_AMASK_MASK           ((uint32_t)0x00000001U)
#define FLASH_FCIM_AMASK_DIS            ((uint32_t)0x00000000U)
#define FLASH_FCIM_AMASK_EN             ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCIM_R_PMASK_MASK         ((uint32_t)0x00000002U)
#define FLASH_FCIM_R_PMASK_BIT          (1U)
#define FLASH_FCIM_R_PMASK_DIS          ((uint32_t)0x00000000U)
#define FLASH_FCIM_R_PMASK_EN           ((uint32_t)0x00000002U)

#define FLASH_FCIM_PMASK_MASK           ((uint32_t)0x00000001U)
#define FLASH_FCIM_PMASK_DIS            ((uint32_t)0x00000000U)
#define FLASH_FCIM_PMASK_EN             ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCIM_R_EMASK_MASK         ((uint32_t)0x00000004U)
#define FLASH_FCIM_R_EMASK_BIT          (2U)
#define FLASH_FCIM_R_EMASK_DIS          ((uint32_t)0x00000000U)
#define FLASH_FCIM_R_EMASK_EN           ((uint32_t)0x00000004U)

#define FLASH_FCIM_EMASK_MASK           ((uint32_t)0x00000001U)
#define FLASH_FCIM_EMASK_DIS            ((uint32_t)0x00000000U)
#define FLASH_FCIM_EMASK_EN             ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCIM_R_VOLTMASK_MASK      ((uint32_t)0x00000200U)
#define FLASH_FCIM_R_VOLTMASK_BIT       (9U)
#define FLASH_FCIM_R_VOLTMASK_DIS       ((uint32_t)0x00000000U)
#define FLASH_FCIM_R_VOLTMASK_EN        ((uint32_t)0x00000200U)

#define FLASH_FCIM_VOLTMASK_MASK        ((uint32_t)0x00000001U)
#define FLASH_FCIM_VOLTMASK_DIS         ((uint32_t)0x00000000U)
#define FLASH_FCIM_VOLTMASK_EN          ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCIM_R_INVDMASK_MASK      ((uint32_t)0x00000400U)
#define FLASH_FCIM_R_INVDMASK_BIT       (10U)
#define FLASH_FCIM_R_INVDMASK_DIS       ((uint32_t)0x00000000U)
#define FLASH_FCIM_R_INVDMASK_EN        ((uint32_t)0x00000400U)

#define FLASH_FCIM_INVDMASK_MASK        ((uint32_t)0x00000001U)
#define FLASH_FCIM_INVDMASK_DIS         ((uint32_t)0x00000000U)
#define FLASH_FCIM_INVDMASK_EN          ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCIM_R_ERMASK_MASK        ((uint32_t)0x00000800U)
#define FLASH_FCIM_R_ERMASK_BIT         (11U)
#define FLASH_FCIM_R_ERMASK_DIS         ((uint32_t)0x00000000U)
#define FLASH_FCIM_R_ERMASK_EN          ((uint32_t)0x00000800U)

#define FLASH_FCIM_ERMASK_MASK          ((uint32_t)0x00000001U)
#define FLASH_FCIM_ERMASK_DIS           ((uint32_t)0x00000000U)
#define FLASH_FCIM_ERMASK_EN            ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCIM_R_PROGMASK_MASK      ((uint32_t)0x00002000U)
#define FLASH_FCIM_R_PROGMASK_BIT       (13U)
#define FLASH_FCIM_R_PROGMASK_DIS       ((uint32_t)0x00000000U)
#define FLASH_FCIM_R_PROGMASK_EN        ((uint32_t)0x00002000U)

#define FLASH_FCIM_PROGMASK_MASK        ((uint32_t)0x00000001U)
#define FLASH_FCIM_PROGMASK_DIS         ((uint32_t)0x00000000U)
#define FLASH_FCIM_PROGMASK_EN          ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************ 6 FCMISC *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_FCMISC_R_AMISC_MASK       ((uint32_t)0x00000001U)
#define FLASH_FCMISC_R_AMISC_BIT        (0U)
#define FLASH_FCMISC_R_AMISC_NOOCCUR    ((uint32_t)0x00000000U)
#define FLASH_FCMISC_R_AMISC_OCCUR      ((uint32_t)0x00000001U)
#define FLASH_FCMISC_R_AMISC_CLEAR      ((uint32_t)0x00000001U)

#define FLASH_FCMISC_AMISC_MASK         ((uint32_t)0x00000001U)
#define FLASH_FCMISC_AMISC_NOOCCUR      ((uint32_t)0x00000000U)
#define FLASH_FCMISC_AMISC_OCCUR        ((uint32_t)0x00000001U)
#define FLASH_FCMISC_AMISC_CLEAR        ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCMISC_R_PMISC_MASK       ((uint32_t)0x00000002U)
#define FLASH_FCMISC_R_PMISC_BIT        (1U)
#define FLASH_FCMISC_R_PMISC_NOOCCUR    ((uint32_t)0x00000000U)
#define FLASH_FCMISC_R_PMISC_OCCUR      ((uint32_t)0x00000002U)
#define FLASH_FCMISC_R_PMISC_CLEAR      ((uint32_t)0x00000002U)

#define FLASH_FCMISC_PMISC_MASK         ((uint32_t)0x00000001U)
#define FLASH_FCMISC_PMISC_NOOCCUR      ((uint32_t)0x00000000U)
#define FLASH_FCMISC_PMISC_OCCUR        ((uint32_t)0x00000001U)
#define FLASH_FCMISC_PMISC_CLEAR        ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCMISC_R_EMISC_MASK       ((uint32_t)0x00000004U)
#define FLASH_FCMISC_R_EMISC_BIT        (2U)
#define FLASH_FCMISC_R_EMISC_NOOCCUR    ((uint32_t)0x00000000U)
#define FLASH_FCMISC_R_EMISC_OCCUR      ((uint32_t)0x00000004U)
#define FLASH_FCMISC_R_EMISC_CLEAR      ((uint32_t)0x00000004U)

#define FLASH_FCMISC_EMISC_MASK         ((uint32_t)0x00000001U)
#define FLASH_FCMISC_EMISC_NOOCCUR      ((uint32_t)0x00000000U)
#define FLASH_FCMISC_EMISC_OCCUR        ((uint32_t)0x00000001U)
#define FLASH_FCMISC_EMISC_CLEAR        ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCMISC_R_VOLTMISC_MASK    ((uint32_t)0x00000200U)
#define FLASH_FCMISC_R_VOLTMISC_BIT     (9U)
#define FLASH_FCMISC_R_VOLTMISC_NOOCCUR ((uint32_t)0x00000000U)
#define FLASH_FCMISC_R_VOLTMISC_OCCUR   ((uint32_t)0x00000200U)
#define FLASH_FCMISC_R_VOLTMISC_CLEAR   ((uint32_t)0x00000200U)

#define FLASH_FCMISC_VOLTMISC_MASK      ((uint32_t)0x00000001U)
#define FLASH_FCMISC_VOLTMISC_NOOCCUR   ((uint32_t)0x00000000U)
#define FLASH_FCMISC_VOLTMISC_OCCUR     ((uint32_t)0x00000001U)
#define FLASH_FCMISC_VOLTMISC_CLEAR     ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCMISC_R_INVDMISC_MASK    ((uint32_t)0x00000400U)
#define FLASH_FCMISC_R_INVDMISC_BIT     (10U)
#define FLASH_FCMISC_R_INVDMISC_NOOCCUR ((uint32_t)0x00000000U)
#define FLASH_FCMISC_R_INVDMISC_OCCUR   ((uint32_t)0x00000400U)
#define FLASH_FCMISC_R_INVDMISC_CLEAR   ((uint32_t)0x00000400U)

#define FLASH_FCMISC_INVDMISC_MASK      ((uint32_t)0x00000001U)
#define FLASH_FCMISC_INVDMISC_NOOCCUR   ((uint32_t)0x00000000U)
#define FLASH_FCMISC_INVDMISC_OCCUR     ((uint32_t)0x00000001U)
#define FLASH_FCMISC_INVDMISC_CLEAR     ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCMISC_R_ERMISC_MASK      ((uint32_t)0x00000800U)
#define FLASH_FCMISC_R_ERMISC_BIT       (11U)
#define FLASH_FCMISC_R_ERMISC_NOOCCUR   ((uint32_t)0x00000000U)
#define FLASH_FCMISC_R_ERMISC_OCCUR     ((uint32_t)0x00000800U)
#define FLASH_FCMISC_R_ERMISC_CLEAR     ((uint32_t)0x00000800U)

#define FLASH_FCMISC_ERMISC_MASK        ((uint32_t)0x00000001U)
#define FLASH_FCMISC_ERMISC_NOOCCUR     ((uint32_t)0x00000000U)
#define FLASH_FCMISC_ERMISC_OCCUR       ((uint32_t)0x00000001U)
#define FLASH_FCMISC_ERMISC_CLEAR       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FCMISC_R_PROGMISC_MASK    ((uint32_t)0x0002000U)
#define FLASH_FCMISC_R_PROGMISC_BIT     (13U)
#define FLASH_FCMISC_R_PROGMISC_NOOCCUR ((uint32_t)0x00000000U)
#define FLASH_FCMISC_R_PROGMISC_OCCUR   ((uint32_t)0x00002000U)
#define FLASH_FCMISC_R_PROGMISC_CLEAR   ((uint32_t)0x00002000U)

#define FLASH_FCMISC_PROGMISC_MASK      ((uint32_t)0x00000001U)
#define FLASH_FCMISC_PROGMISC_NOOCCUR   ((uint32_t)0x00000000U)
#define FLASH_FCMISC_PROGMISC_OCCUR     ((uint32_t)0x00000001U)
#define FLASH_FCMISC_PROGMISC_CLEAR     ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************ 7 FMC2 *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_FMC2_R_WRBUF_MASK         ((uint32_t)0x00000001U)
#define FLASH_FMC2_R_WRBUF_BIT          (0U)
#define FLASH_FMC2_R_WRBUF_COMPLETE     ((uint32_t)0x00000000U)
#define FLASH_FMC2_R_WRBUF_NOCOMPLETE   ((uint32_t)0x00000001U)
#define FLASH_FMC2_R_WRBUF_WRITE        ((uint32_t)0x00000001U)

#define FLASH_FMC2_WRBUF_MASK           ((uint32_t)0x00000001U)
#define FLASH_FMC2_WRBUF_COMPLETE       ((uint32_t)0x00000000U)
#define FLASH_FMC2_WRBUF_NOCOMPLETE     ((uint32_t)0x00000001U)
#define FLASH_FMC2_WRBUF_WRITE          ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FMC2_R_WRKEY_MASK         ((uint32_t)0xFFFF0000U)
#define FLASH_FMC2_R_WRKEY_BIT          (16U)
#define FLASH_FMC2_R_WRKEY_KEY1         ((uint32_t)0xA4420000U)
#define FLASH_FMC2_R_WRKEY_KEY2         ((uint32_t)0x71D50000U)

#define FLASH_FMC2_WRKEY_MASK           ((uint32_t)0x0000FFFFU)
#define FLASH_FMC2_WRKEY_KEY1           ((uint32_t)0x0000A442U)
#define FLASH_FMC2_WRKEY_KEY2           ((uint32_t)0x000071D5U)
/*----------*/

/******************************************************************************************
************************************ 8 FWBVAL *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_FWBVAL_R_FWB0_MASK        ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_R_FWB0_BIT         (0U)
#define FLASH_FWBVAL_R_FWB0_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB0_NEWDATA     ((uint32_t)0x00000001U)

#define FLASH_FWBVAL_FWB0_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB0_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB0_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB1_MASK        ((uint32_t)0x00000002U)
#define FLASH_FWBVAL_R_FWB1_BIT         (1U)
#define FLASH_FWBVAL_R_FWB1_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB1_NEWDATA     ((uint32_t)0x00000002U)

#define FLASH_FWBVAL_FWB1_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB1_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB1_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB2_MASK        ((uint32_t)0x00000004U)
#define FLASH_FWBVAL_R_FWB2_BIT         (2U)
#define FLASH_FWBVAL_R_FWB2_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB2_NEWDATA     ((uint32_t)0x00000004U)

