InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/FLASH/Peripheral/Register/xHeader/FLASH_RegisterDefines.h
#define FLASH_FWBVAL_FWB2_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB2_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB2_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB3_MASK        ((uint32_t)0x00000008U)
#define FLASH_FWBVAL_R_FWB3_BIT         (3U)
#define FLASH_FWBVAL_R_FWB3_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB3_NEWDATA     ((uint32_t)0x00000008U)

#define FLASH_FWBVAL_FWB3_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB3_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB3_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB4_MASK        ((uint32_t)0x00000010U)
#define FLASH_FWBVAL_R_FWB4_BIT         (4U)
#define FLASH_FWBVAL_R_FWB4_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB4_NEWDATA     ((uint32_t)0x00000010U)

#define FLASH_FWBVAL_FWB4_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB4_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB4_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB5_MASK        ((uint32_t)0x00000020U)
#define FLASH_FWBVAL_R_FWB5_BIT         (5U)
#define FLASH_FWBVAL_R_FWB5_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB5_NEWDATA     ((uint32_t)0x00000020U)

#define FLASH_FWBVAL_FWB5_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB5_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB5_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB6_MASK        ((uint32_t)0x00000040U)
#define FLASH_FWBVAL_R_FWB6_BIT         (6U)
#define FLASH_FWBVAL_R_FWB6_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB6_NEWDATA     ((uint32_t)0x00000040U)

#define FLASH_FWBVAL_FWB6_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB6_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB6_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB7_MASK        ((uint32_t)0x00000080U)
#define FLASH_FWBVAL_R_FWB7_BIT         (7U)
#define FLASH_FWBVAL_R_FWB7_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB7_NEWDATA     ((uint32_t)0x00000080U)

#define FLASH_FWBVAL_FWB7_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB7_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB7_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB8_MASK        ((uint32_t)0x00000100U)
#define FLASH_FWBVAL_R_FWB8_BIT         (8U)
#define FLASH_FWBVAL_R_FWB8_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB8_NEWDATA     ((uint32_t)0x00000100U)

#define FLASH_FWBVAL_FWB8_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB8_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB8_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB9_MASK        ((uint32_t)0x00000200U)
#define FLASH_FWBVAL_R_FWB9_BIT         (9U)
#define FLASH_FWBVAL_R_FWB9_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB9_NEWDATA     ((uint32_t)0x00000200U)

#define FLASH_FWBVAL_FWB9_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB9_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB9_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB10_MASK        ((uint32_t)0x00000400U)
#define FLASH_FWBVAL_R_FWB10_BIT         (10U)
#define FLASH_FWBVAL_R_FWB10_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB10_NEWDATA     ((uint32_t)0x00000400U)

#define FLASH_FWBVAL_FWB10_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB10_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB10_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB11_MASK        ((uint32_t)0x00000800U)
#define FLASH_FWBVAL_R_FWB11_BIT         (11U)
#define FLASH_FWBVAL_R_FWB11_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB11_NEWDATA     ((uint32_t)0x00000800U)

#define FLASH_FWBVAL_FWB11_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB11_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB11_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB12_MASK        ((uint32_t)0x00001000U)
#define FLASH_FWBVAL_R_FWB12_BIT         (12U)
#define FLASH_FWBVAL_R_FWB12_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB12_NEWDATA     ((uint32_t)0x00001000U)

#define FLASH_FWBVAL_FWB12_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB12_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB12_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB13_MASK        ((uint32_t)0x00002000U)
#define FLASH_FWBVAL_R_FWB13_BIT         (13U)
#define FLASH_FWBVAL_R_FWB13_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB13_NEWDATA     ((uint32_t)0x00002000U)

#define FLASH_FWBVAL_FWB13_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB13_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB13_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB14_MASK        ((uint32_t)0x00004000U)
#define FLASH_FWBVAL_R_FWB14_BIT         (14U)
#define FLASH_FWBVAL_R_FWB14_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB14_NEWDATA     ((uint32_t)0x00004000U)

#define FLASH_FWBVAL_FWB14_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB14_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB14_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB15_MASK        ((uint32_t)0x00008000U)
#define FLASH_FWBVAL_R_FWB15_BIT         (15U)
#define FLASH_FWBVAL_R_FWB15_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB15_NEWDATA     ((uint32_t)0x00008000U)

