InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/FLASH/Peripheral/Register/xHeader/FLASH_RegisterDefines.h
#define FLASH_FWBVAL_FWB15_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB15_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB15_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB16_MASK        ((uint32_t)0x00010000U)
#define FLASH_FWBVAL_R_FWB16_BIT         (16U)
#define FLASH_FWBVAL_R_FWB16_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB16_NEWDATA     ((uint32_t)0x00010000U)

#define FLASH_FWBVAL_FWB16_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB16_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB16_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB17_MASK        ((uint32_t)0x00020000U)
#define FLASH_FWBVAL_R_FWB17_BIT         (17U)
#define FLASH_FWBVAL_R_FWB17_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB17_NEWDATA     ((uint32_t)0x00020000U)

#define FLASH_FWBVAL_FWB17_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB17_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB17_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB18_MASK        ((uint32_t)0x00040000U)
#define FLASH_FWBVAL_R_FWB18_BIT         (18U)
#define FLASH_FWBVAL_R_FWB18_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB18_NEWDATA     ((uint32_t)0x00040000U)

#define FLASH_FWBVAL_FWB18_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB18_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB18_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB19_MASK        ((uint32_t)0x00080000U)
#define FLASH_FWBVAL_R_FWB19_BIT         (19U)
#define FLASH_FWBVAL_R_FWB19_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB19_NEWDATA     ((uint32_t)0x00080000U)

#define FLASH_FWBVAL_FWB19_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB19_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB19_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB20_MASK        ((uint32_t)0x00100000U)
#define FLASH_FWBVAL_R_FWB20_BIT         (20U)
#define FLASH_FWBVAL_R_FWB20_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB20_NEWDATA     ((uint32_t)0x00100000U)

#define FLASH_FWBVAL_FWB20_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB20_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB20_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB21_MASK        ((uint32_t)0x00200000U)
#define FLASH_FWBVAL_R_FWB21_BIT         (21U)
#define FLASH_FWBVAL_R_FWB21_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB21_NEWDATA     ((uint32_t)0x00200000U)

#define FLASH_FWBVAL_FWB21_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB21_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB21_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB22_MASK        ((uint32_t)0x00400000U)
#define FLASH_FWBVAL_R_FWB22_BIT         (22U)
#define FLASH_FWBVAL_R_FWB22_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB22_NEWDATA     ((uint32_t)0x00400000U)

#define FLASH_FWBVAL_FWB22_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB22_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB22_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB23_MASK        ((uint32_t)0x00800000U)
#define FLASH_FWBVAL_R_FWB23_BIT         (23U)
#define FLASH_FWBVAL_R_FWB23_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB23_NEWDATA     ((uint32_t)0x00800000U)

#define FLASH_FWBVAL_FWB23_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB23_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB23_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB24_MASK        ((uint32_t)0x01000000U)
#define FLASH_FWBVAL_R_FWB24_BIT         (24U)
#define FLASH_FWBVAL_R_FWB24_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB24_NEWDATA     ((uint32_t)0x01000000U)

#define FLASH_FWBVAL_FWB24_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB24_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB24_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB25_MASK        ((uint32_t)0x02000000U)
#define FLASH_FWBVAL_R_FWB25_BIT         (25U)
#define FLASH_FWBVAL_R_FWB25_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB25_NEWDATA     ((uint32_t)0x02000000U)

#define FLASH_FWBVAL_FWB25_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB25_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB25_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB26_MASK        ((uint32_t)0x04000000U)
#define FLASH_FWBVAL_R_FWB26_BIT         (26U)
#define FLASH_FWBVAL_R_FWB26_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB26_NEWDATA     ((uint32_t)0x04000000U)

#define FLASH_FWBVAL_FWB26_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB26_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB26_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB27_MASK        ((uint32_t)0x08000000U)
#define FLASH_FWBVAL_R_FWB27_BIT         (27U)
#define FLASH_FWBVAL_R_FWB27_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB27_NEWDATA     ((uint32_t)0x08000000U)

#define FLASH_FWBVAL_FWB27_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB27_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB27_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB28_MASK        ((uint32_t)0x10000000U)
#define FLASH_FWBVAL_R_FWB28_BIT         (28U)
#define FLASH_FWBVAL_R_FWB28_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB28_NEWDATA     ((uint32_t)0x10000000U)

#define FLASH_FWBVAL_FWB28_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB28_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB28_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB29_MASK        ((uint32_t)0x20000000U)
#define FLASH_FWBVAL_R_FWB29_BIT         (29U)
#define FLASH_FWBVAL_R_FWB29_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB29_NEWDATA     ((uint32_t)0x20000000U)

#define FLASH_FWBVAL_FWB29_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB29_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB29_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB30_MASK        ((uint32_t)0x40000000U)
#define FLASH_FWBVAL_R_FWB30_BIT         (30U)
#define FLASH_FWBVAL_R_FWB30_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB30_NEWDATA     ((uint32_t)0x40000000U)

#define FLASH_FWBVAL_FWB30_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB30_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB30_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define FLASH_FWBVAL_R_FWB31_MASK        ((uint32_t)0x80000000U)
#define FLASH_FWBVAL_R_FWB31_BIT         (31U)
#define FLASH_FWBVAL_R_FWB31_NODATA      ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_R_FWB31_NEWDATA     ((uint32_t)0x80000000U)

#define FLASH_FWBVAL_FWB31_MASK          ((uint32_t)0x00000001U)
#define FLASH_FWBVAL_FWB31_NODATA        ((uint32_t)0x00000000U)
#define FLASH_FWBVAL_FWB31_NEWDATA       ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************ 9-40 FWBn *********************************************
******************************************************************************************/

/******************************************************************************************
************************************ 41 FSIZE *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_FSIZE_R_SIZE_MASK     ((uint32_t)0x0000FFFFU)
#define FLASH_FSIZE_R_SIZE_BIT      (0U)
#define FLASH_FSIZE_R_SIZE_256KB    ((uint32_t)0x0000007FU)

#define FLASH_FSIZE_SIZE_MASK       ((uint32_t)0x0000FFFFU)
#define FLASH_FSIZE_SIZE_256KB      ((uint32_t)0x0000007FU)
/*----------*/

/******************************************************************************************
************************************ 42 SSIZE *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_SSIZE_R_SIZE_MASK     ((uint32_t)0x0000FFFFU)
#define FLASH_SSIZE_R_SIZE_BIT      (0U)
#define FLASH_SSIZE_R_SIZE_32KB     ((uint32_t)0x0000007FU)

#define FLASH_SSIZE_SIZE_MASK       ((uint32_t)0x0000FFFFU)
#define FLASH_SSIZE_SIZE_32KB       ((uint32_t)0x0000007FU)
/*----------*/

/******************************************************************************************
************************************ 43 ROMSWMAP *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_ROMSWMAP_R_SAFERTOS_MASK      ((uint32_t)0x00000001U)
#define FLASH_ROMSWMAP_R_SAFERTOS_BIT       (0U)
#define FLASH_ROMSWMAP_R_SAFERTOS_NOPRESENT ((uint32_t)0x00000000U)
#define FLASH_ROMSWMAP_R_SAFERTOS_PRESENT   ((uint32_t)0x00000001U)

#define FLASH_ROMSWMAP_SAFERTOS_MASK       ((uint32_t)0x00000001U)
#define FLASH_ROMSWMAP_SAFERTOS_NOPRESENT  ((uint32_t)0x00000000U)
#define FLASH_ROMSWMAP_SAFERTOS_PRESENT    ((uint32_t)0x00000001U)
/*----------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_FLASH_FLASH_PERIPHERAL_FLASH_REGISTER_FLASH_REGISTERDEFINES_H_ */
